{
  "max_len": 128,
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "On": 2,
    "next": 3,
    "month": 4,
    ",": 5,
    "JPMorgan": 6,
    "Chase": 7,
    "revealed": 8,
    "80": 9,
    "M": 10,
    "\u00a5": 11,
    "for": 12,
    "the": 13,
    "takeover": 14,
    "bid": 15,
    ".": 16,
    "December": 17,
    "Citigroup": 18,
    "finalized": 19,
    "GBP": 20,
    "2.5": 21,
    "billion": 22,
    "merger": 23,
    "tomorrow": 24,
    "Adobe": 25,
    "is": 26,
    "targeting": 27,
    "a": 28,
    "new": 29,
    "5": 30,
    "initial": 31,
    "public": 32,
    "offering": 33,
    "Visa": 34,
    "experienced": 35,
    "EUR": 36,
    "debt": 37,
    "refinancing": 38,
    "on": 39,
    "June": 40,
    "30": 41,
    "HSBC": 42,
    "shares": 43,
    "spiked": 44,
    "as": 45,
    "Google": 46,
    "\u00a3": 47,
    "45": 48,
    "million": 49,
    "share": 50,
    "buyback": 51,
    "program": 52,
    "Salesforce": 53,
    "(": 54,
    "TSLA": 55,
    ")": 56,
    "planning": 57,
    "to": 58,
    "launch": 59,
    "2": 60,
    "B": 61,
    "acquisition": 62,
    "deal": 63,
    "last": 64,
    "week": 65,
    "Stripe": 66,
    "reported": 67,
    "earnings": 68,
    "growth": 69,
    "valued": 70,
    "at": 71,
    "Tuesday": 72,
    "Monday": 73,
    "PayPlus": 74,
    "submitted": 75,
    "documents": 76,
    "investment": 77,
    "plan": 78,
    "bankruptcy": 79,
    "filing": 80,
    "$": 81,
    "today": 82,
    "NVDA": 83,
    "AMZN": 84,
    "Alphabet": 85,
    "restructuring": 86,
    "Qualcomm": 87,
    "Q3": 88,
    "report": 89,
    "Broadcom": 90,
    "suspended": 91,
    "due": 92,
    "10": 93,
    "fiscal": 94,
    "outlook": 95,
    "expansion": 96,
    "year": 97,
    "2026": 98,
    "AMD": 99,
    "disclosed": 100,
    "850": 101,
    "MSFT": 102,
    "150": 103,
    "per": 104,
    "USD": 105,
    "dividend": 106,
    "payout": 107,
    "90": 108,
    "January": 109,
    "15": 110,
    "Friday": 111,
    "Goldman": 112,
    "Sachs": 113,
    "announced": 114,
    "JPY": 115,
    "BRK": 116,
    "A": 117,
    "Microsoft": 118,
    "voted": 119,
    "500": 120,
    "stock": 121,
    "split": 122,
    "\u20ac": 123,
    "yesterday": 124,
    "Meta": 125,
    "SoftBank": 126,
    "agreed": 127,
    "execute": 128,
    "Thursday": 129,
    "witnessed": 130,
    "TSM": 131,
    "financial": 132,
    "audit": 133,
    "NFLX": 134,
    "AVGO": 135,
    "completed": 136,
    "Q4": 137,
    "2025": 138,
    "1.2": 139,
    "trillion": 140,
    "Intel": 141,
    "300": 142,
    "000": 143,
    "TSMC": 144,
    "12": 145,
    "GS": 146,
    "Tesla": 147,
    "4.2": 148,
    "anticipating": 149,
    "AAPL": 150,
    "Apple": 151,
    "Wednesday": 152,
    "NVIDIA": 153,
    "CRM": 154,
    "INTC": 155,
    "Amazon": 156,
    "GOOGL": 157,
    "MS": 158,
    "META": 159,
    "Netflix": 160,
    "ASML": 161,
    "QCOM": 162,
    "JPM": 163,
    "Berkshire": 164,
    "Hathaway": 165,
    "C": 166,
    "Morgan": 167,
    "Stanley": 168,
    "ADBE": 169,
    "acquired": 170,
    "in": 171,
    "Federal": 172,
    "Reserve": 173,
    "rate": 174,
    "decision": 175,
    "interest": 176,
    "hike": 177,
    "inflation": 178
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "On",
    "3": "next",
    "4": "month",
    "5": ",",
    "6": "JPMorgan",
    "7": "Chase",
    "8": "revealed",
    "9": "80",
    "10": "M",
    "11": "\u00a5",
    "12": "for",
    "13": "the",
    "14": "takeover",
    "15": "bid",
    "16": ".",
    "17": "December",
    "18": "Citigroup",
    "19": "finalized",
    "20": "GBP",
    "21": "2.5",
    "22": "billion",
    "23": "merger",
    "24": "tomorrow",
    "25": "Adobe",
    "26": "is",
    "27": "targeting",
    "28": "a",
    "29": "new",
    "30": "5",
    "31": "initial",
    "32": "public",
    "33": "offering",
    "34": "Visa",
    "35": "experienced",
    "36": "EUR",
    "37": "debt",
    "38": "refinancing",
    "39": "on",
    "40": "June",
    "41": "30",
    "42": "HSBC",
    "43": "shares",
    "44": "spiked",
    "45": "as",
    "46": "Google",
    "47": "\u00a3",
    "48": "45",
    "49": "million",
    "50": "share",
    "51": "buyback",
    "52": "program",
    "53": "Salesforce",
    "54": "(",
    "55": "TSLA",
    "56": ")",
    "57": "planning",
    "58": "to",
    "59": "launch",
    "60": "2",
    "61": "B",
    "62": "acquisition",
    "63": "deal",
    "64": "last",
    "65": "week",
    "66": "Stripe",
    "67": "reported",
    "68": "earnings",
    "69": "growth",
    "70": "valued",
    "71": "at",
    "72": "Tuesday",
    "73": "Monday",
    "74": "PayPlus",
    "75": "submitted",
    "76": "documents",
    "77": "investment",
    "78": "plan",
    "79": "bankruptcy",
    "80": "filing",
    "81": "$",
    "82": "today",
    "83": "NVDA",
    "84": "AMZN",
    "85": "Alphabet",
    "86": "restructuring",
    "87": "Qualcomm",
    "88": "Q3",
    "89": "report",
    "90": "Broadcom",
    "91": "suspended",
    "92": "due",
    "93": "10",
    "94": "fiscal",
    "95": "outlook",
    "96": "expansion",
    "97": "year",
    "98": "2026",
    "99": "AMD",
    "100": "disclosed",
    "101": "850",
    "102": "MSFT",
    "103": "150",
    "104": "per",
    "105": "USD",
    "106": "dividend",
    "107": "payout",
    "108": "90",
    "109": "January",
    "110": "15",
    "111": "Friday",
    "112": "Goldman",
    "113": "Sachs",
    "114": "announced",
    "115": "JPY",
    "116": "BRK",
    "117": "A",
    "118": "Microsoft",
    "119": "voted",
    "120": "500",
    "121": "stock",
    "122": "split",
    "123": "\u20ac",
    "124": "yesterday",
    "125": "Meta",
    "126": "SoftBank",
    "127": "agreed",
    "128": "execute",
    "129": "Thursday",
    "130": "witnessed",
    "131": "TSM",
    "132": "financial",
    "133": "audit",
    "134": "NFLX",
    "135": "AVGO",
    "136": "completed",
    "137": "Q4",
    "138": "2025",
    "139": "1.2",
    "140": "trillion",
    "141": "Intel",
    "142": "300",
    "143": "000",
    "144": "TSMC",
    "145": "12",
    "146": "GS",
    "147": "Tesla",
    "148": "4.2",
    "149": "anticipating",
    "150": "AAPL",
    "151": "Apple",
    "152": "Wednesday",
    "153": "NVIDIA",
    "154": "CRM",
    "155": "INTC",
    "156": "Amazon",
    "157": "GOOGL",
    "158": "MS",
    "159": "META",
    "160": "Netflix",
    "161": "ASML",
    "162": "QCOM",
    "163": "JPM",
    "164": "Berkshire",
    "165": "Hathaway",
    "166": "C",
    "167": "Morgan",
    "168": "Stanley",
    "169": "ADBE",
    "170": "acquired",
    "171": "in",
    "172": "Federal",
    "173": "Reserve",
    "174": "rate",
    "175": "decision",
    "176": "interest",
    "177": "hike",
    "178": "inflation"
  }
}